chat-app/artillery-tests/artillery/realistic-test.yml
# Artillery 真实场景模拟测试
#
# 测试目标：
# 模拟真实用户行为，包括：
# 1. 发送私聊和群聊消息
# 2. 正常的连接保持和断开
#
# 用法:
#   artillery run artillery/realistic-test.yml

config:
  target: "https://chat.laoyegong.xyz"

  phases:
    # 早高峰模拟
    - duration: 60
      arrivalRate: 3
      rampTo: 8
      name: "Morning peak ramp"

    # 高峰持续
    - duration: 120
      arrivalRate: 8
      name: "Peak hours"

    # 下降期
    - duration: 60
      arrivalRate: 8
      rampTo: 3
      name: "Decline"

    # 平稳期
    - duration: 60
      arrivalRate: 3
      name: "Normal hours"

  payload:
    path: "./tokens.csv"
    fields:
      - "account"
      - "userId"
      - "token"
      - "friendId"
      - "groupId"
      - "groupConversationId"
    order: random

  engines:
    socketio-v3:
      transports: ["websocket"]
      reconnection: false
      timeout: 15000

scenarios:
  # 场景1: 活跃用户 (频繁发消息)
  - name: "活跃用户"
    weight: 2
    engine: socketio-v3
    flow:
      - connect:
          query:
            token: "{{ token }}"

      - think: 3

      # 活跃聊天
      - loop:
        - emit:
            channel: "typing"
            data:
              receiverId: "{{ friendId }}"
        - think: 2
        - emit:
            channel: "send_message"
            data:
              receiverId: "{{ friendId }}"
              type: "text"
              content: "活跃用户消息 {{ $timestamp }}"
        - think: 5
        - emit:
            channel: "send_message"
            data:
              conversationId: "{{ groupConversationId }}"
              type: "text"
              content: "群内消息 {{ $timestamp }}"
        - think: 8
        count: 5

      # 保持在线
      - think: 60

  # 场景2: 普通用户 (偶尔发消息)
  - name: "普通用户"
    weight: 4
    engine: socketio-v3
    flow:
      - connect:
          query:
            token: "{{ token }}"

      - think: 5

      # 偶尔发消息
      - loop:
        - think: 15
        - emit:
            channel: "send_message"
            data:
              receiverId: "{{ friendId }}"
              type: "text"
              content: "普通消息 {{ $timestamp }}"
        count: 3

      # 在线等待
      - think: 120

  # 场景3: 潜水用户 (只看不发)
  - name: "潜水用户"
    weight: 3
    engine: socketio-v3
    flow:
      - connect:
          query:
            token: "{{ token }}"

      # 长时间潜水
      - think: 180

  # 场景4: 短暂在线用户
  - name: "短暂在线"
    weight: 2
    engine: socketio-v3
    flow:
      - connect:
          query:
            token: "{{ token }}"

      # 快速发一条消息
      - think: 2
      - emit:
          channel: "send_message"
          data:
            receiverId: "{{ friendId }}"
            type: "text"
            content: "短暂消息 {{ $timestamp }}"

      # 很快离开
      - think: 10